Repository: slic3r/Slic3r
Catalog: translation/*.po
Languages: hy_am

source: This setting applies an additional overlap between infill and perimeters for better bonding. Theoretically this shouldn't be needed, but backlash might cause gaps. If expressed as percentage (example: 15%) it is calculated over perimeter extrusion width.
hy_am: Այս կարգավորումը առաջացնում է լրացուցիչ համընկնումներ լցոնման և շրջագծերի միջև,որն էլ կապը դարձնում է ավելի ամուր: Տեսականորեն սրա կարիքը չպետք է լիներ, բայցհակազդեցությունը կարող է առաջացնել փոսեր/բացեր: Եթե գրում ենք տոկոսով (օրինակ՝ 15%),ապա այն հաշվարկվում է շրջագծի արտամղման լայնությամբ:

source: Speed for printing the internal fill.
hy_am: Ներքին լցոնման տպման արագությունը

source: Interior brim width
hy_am: Ներսի ընդգրկող շրջանի հաստությունը

source: Horizontal width of the brim that will be printed inside object holes on the first layer.
hy_am: Եզրագծի հորիզոնական լայնությունը, որը կտպվի առաջին շերտի վրա գտնվող առարկաների անցքերի ներսում:

source: Interface shells
hy_am: Երևացող պատյանները

source: Force the generation of solid shells between adjacent materials/volumes. Useful for multi-extruder prints with translucent materials or manual soluble support material.
hy_am: Ստիպել պինդ պատյանների առաջացումը հարակից նյութերի/ծավալների միջև:Օգտակար է կիսաթափանցիկ կամ լուծվող նյութով մեկից ավելի արտամղիչ գլխիկներովտպագրության համար

source: After layer change G-code
hy_am: Շերտից հետո փոխել G-code֊ը

source: This custom code is inserted at every layer change, right after the Z move and before the extruder moves to the first layer point. Note that you can use placeholder variables for all Slic3r settings as well as [layer_num] and [layer_z].
hy_am: Այս հատուկ կոդը տեղադրվում է յուրաքանչյուր շերտի փոփոխության ժամանակ, Z-ի շարժումիցանմիջապես հետո, և մինչ գլխիկը կտեղափոխվի առաջին շերտի դիրքը: Նկատի ունեցեք, որ դուքկարող եք օգտագործել, որպես դաշտի հուշող փոփոխականները Slic3r-ի բոլոր կարգավորումների,ինչպես նաև [layer_num] և [layer_z]-ի համար:

source: Layer height
hy_am: Շերտի բարձրությունը

source: This setting controls the height (and thus the total number) of the slices/layers. Thinner layers give better accuracy but take more time to print.
hy_am: Այս կարգավորումը վերահսկում է շերտազատումների/շերտերի բարձրությունը (այսինքն ընդհանուր թիվը):Բարակ շերտերի դեպքում տպագրությյունն ավելի ճշգրտություն է լինում, սակայն այնպահանջում է երկար ժամանակ:

source: Max
hy_am: Առավելագույն

source: This setting represents the maximum speed of your fan.
hy_am: Այս կարգավորումը ներկայացնում է օդափոխիչ սարքի առավելագույն արագությունը

source: Max print speed
hy_am: Տպիչի առավելագույն արագությունը

source: When setting other speed settings to 0 Slic3r will autocalculate the optimal speed in order to keep constant extruder pressure. This experimental setting is used to set the highest print speed you want to allow.
hy_am: Երբ արագության այլ կարգավորումները սահմանվում է 0, ապա Slic3r-ը ինքնաբերաբար կհաշվի այն օպտիմալ արագությունն, որի դեպքում արտամղող գլխիկը կունենա համաչափ ճնշումը:Այս փորձնական հատկությունը օգտագործվում է տպման գերբարձր արագություն սահմանելու համար:

source: This experimental setting is used to set the maximum volumetric speed your extruder supports.
hy_am: Սա փորձնական հատկություն է, որն օգտագործվում է սահմանելու առավելագույն ծավալայինարագություն արտամղող սարքի համար։

source: Min
hy_am: Նվազագույն

source: This setting represents the minimum PWM your fan needs to work.
hy_am: Այս կարգավորումը ներկայացնում է օդափոխիչի աշխատանքային նվազագույն ԼԻՄ֊ը։

source: Min print speed
hy_am: Տպիչի նվազագույն արագությունը

source: Slic3r will not scale speed down below this speed.
hy_am: Slic3r չի նվազեցնի իրա արագությունը նշվածից ավելի ցածր։

source: Minimum extrusion length
hy_am: Նվազագույն արտամղման երկարություն

source: Generate no less than the number of skirt loops required to consume the specified amount of filament on the bottom layer. For multi-extruder machines, this minimum applies to each extruder.
hy_am: Գեներացնել ոչ պակաս քան փեշի օղակների քանակն է, որն պահանջում է սպառելվերին շերտի նշված քանակի լցանյութ։ Մեկից ավելի գլխիկների դեպքում այս նվազագույնմեծությունը կկիրառվի յուրաքանչյուր գլխիկի համար:

source: Configuration notes
hy_am: Կարգաբերման նշումներ

source: You can put here your personal notes. This text will be added to the G-code header comments.
hy_am: Այստեղ կարող եք տեղադրել ձեր անձնական գրառումները: Այս տեքստը կավելանա G-code֊իգլխագրի մասում, որպես մեկնաբանություններ:

source: Nozzle diameter
hy_am: «Նոզլ»֊ի տրամագիծ

source: This is the diameter of your extruder nozzle (for example: 0.5, 0.35 etc.)
hy_am: Սա տպիչի գլխիկի «նոզլ»֊ի տրամագիծն է (օրինակ՝ 0,5, 0,35 և այլն)

source: Slic3r can upload G-code files to OctoPrint. This field should contain the API Key required for authentication.
hy_am: Slic3r֊ը կարող վերբեռնել G-code նիշքերն դեպի OctoPrint։ Այս դաշտը պետք է պարունակի API Key որն անհրաժեշտ է մուտքագրել։

source: Host or IP
hy_am: Host կամ IP

source: Slic3r can upload G-code files to OctoPrint. This field should contain the hostname or IP address of the OctoPrint instance.
hy_am: Slic3r֊ը կարող վերբեռնել G-code նիշքերն դեպի OctoPrint։ Այս դաշտը պետք է պարունակի hostname կամ IP հասցե OctoPrint օրինակից։

source: Only retract when crossing perimeters
hy_am: Հետ քաշել միայն շրջագծերը հատելիս

source: Disables retraction when the travel path does not exceed the upper layer's perimeters (and thus any ooze will be probably invisible).
hy_am: Անջատում է հետ քաշելը, երբ տեղափոխվելու ուղին չի գերազանցում վերին շերտի շրջագիծը(և այդպիսով ցանկացած արտահոսք անտեսանելի կլինի):

source: Enable
hy_am: Միացնել

source: During multi-extruder prints, this option will drop the temperature of the inactive extruders to prevent oozing. It will enable a tall skirt automatically and move extruders outside such skirt when changing temperatures.
hy_am: Մեկից ավելի արտամղող գլխիկի տպագրության ժամանակ այս տարբերակը կիջեցնի, ոչ֊գործուն գխլխիկների ջերմաստիճանները՝ ծորումը կանխելու համար: Այն ինքնաբերաբար կտա բարձր եզրերի ջերմաստիճան, նաև կտեղափոխի արտամղիչները այս տեսակի եզրերից, երբջերմաստիճանը սկսում է տատանվել

source: Output filename format
hy_am: Ելքային նիշքանվան ձևաչափը

source: You can use all configuration options as variables inside this template. For example: [layer_height], [fill_density] etc. You can also use [timestamp], [year], [month], [day], [hour], [minute], [second], [version], [input_filename], [input_filename_base].
hy_am: Դուք կարող եք օգտագործել կազմավորման բոլոր տարբերակները, որպես փոփոխականներ այսձևանմուշի ներսում: Օրինակ՝ [layer_height], [fill_density] և այլ։ Նաև կարող եքօգտագործել [timestamp], [year], [month], [day], [hour], [minute], [second], [version], [input_filename], [input_filename_base].

source: Detect bridging perimeters
hy_am: Հայտնաբերել կամրջման շրջագծերը

source: Experimental option to adjust flow for overhangs (bridge flow will be used), to apply bridge speed to them and enable fan.
hy_am: Փորձարարական տարբերակ՝ ելքերի համար հոսքը կարգավորելու (կամրջի հոսքը կօգտագործվի),կամրջի արագությունը կիրառելու և հովհարը միացնելու համար:

source: Overridable options
hy_am: Անհաղթահարելի տարբերակներ

source: Perimeters
hy_am: Շրջագծեր

source: This is the acceleration your printer will use for perimeters. A high value like 9000 usually gives good results if your hardware is up to the job. Set zero to disable acceleration control for perimeters.
hy_am: Սա տպիչ արագացումն է շրջագծերի համար: 9000-ի և ավելի բարձր արժեքները սովորաբարլավ արդյունքներ է տալիս, եթե իհարկե ձեր սարքը համապատասխանում է աշխատանքին:Զրոյի դեպքում շրջագծերի արագացման կառավարումն կանջատվի:

source: Perimeter extruder
hy_am: Շրջագծային արտամղիչ

source: The extruder to use when printing perimeters and brim. First extruder is 1.
hy_am: Արտամղիչ գլիկ, որն օգտագործվում է շրջագծերն ու եզրերը տպելիս: Առաջին գլխիկը 1 թիվն է:

source: Set this to a non-zero value to set a manual extrusion width for perimeters. You may want to use thinner extrudates to get more accurate surfaces. If expressed as percentage (for example 200%) it will be computed over layer height.
hy_am: Սահմանեք ոչ զրոյական արժեք՝ շրջագծերի արտամղման լայնությունը ձեռքով սահմանելու համար:Ավելի ճշգրիտ մակերեսներ ստանալու համար կարող եք օգտագործել ավելի բարակ արտամղիչ գլխիկներ:Եթե գրվի տոկոսով (օրինակ 200%), ապա այն կհաշվարկվի շերտի բարձրության վրա

source: Speed for perimeters (contours, aka vertical shells).
hy_am: Շրջագծերի արագությունը (շրջանակներ, ինչպես նաև ուղղաձիգ մակերեսներ).

source: This option sets the number of perimeters to generate for each layer. Note that Slic3r may increase this number automatically when it detects sloping surfaces which benefit from a higher number of perimeters if the Extra Perimeters option is enabled.
hy_am: Այս տարբերակը սահմանում է յուրաքանչյուր շերտի համար գեներացվող շրջագծերի քանակը:Նկատի ունեցեք, որ Slic3r-ը կարող է ինքնաբերաբար մեծացնել այս թիվը, երբ հայտնաբերում էթեք մակերեսներ, որոնք աճում են մեծ թվով շրջագծերի ժամանակ, եթե միացված է«Extra Perimeters» տարբերակը:

source: Post-processing scripts
hy_am: Հետմշակման սցենարներ

source: If you want to process the output G-code through custom scripts, just list their absolute paths here. Separate multiple scripts on individual lines. Scripts will be passed the absolute path to the G-code file as the first argument, and they can access the Slic3r config settings by reading environment variables.
hy_am: Եթե ցանկանում եք մշակել ելքային G-code հատուկ այլագրերի միջոցով, ապա այստեղ նշեք դրանց բացարձակ ուղիները: Սցենարները բացազատեք առանձին տողերի վրա:Սկզբից այլագրերը կգործարկվենG-code նիշքի վրա, հետո նրանք կարող են մուտք գործել Slic3r֊ի կարգավորումներ՝ կարդալովմիջավայրի փոփոխականները:

source: Pressure advance
hy_am: Ճնշման մեծացում

source: When set to a non-zero value, this experimental option enables pressure regulation. It's the K constant for the advance algorithm that pushes more or less filament upon speed changes. It's useful for Bowden-tube extruders. Reasonable values are in range 0-10.
hy_am: Զրոյական արժեքի սահմանման դեպքում փորձարարական տարբերակը հնարավորություն էտալիս կարգավորել ճնշումը: Դա K հաստատունն է առաջնային ալգորիթմի համար, որը քիչ կամ շատնյութ է մղում արագության փոփոխության դեպքում: Այն օգտակար է Bowden-tube գլխիկներ համար:Օգտակար արժեքները գտնվում են 0-10 միջակայքում:

source: Raft layers
hy_am: Օժանդակ շերտեր

source: The object will be raised by this number of layers, and support material will be generated under it.
hy_am: Մաքուր տպագրությունը կսկսի այս քանակի շերտերից հետո, և մինչ այդ կստեղծվի օժանդակ շերտ:

source: Raft offset
hy_am: Օժանդակ շերտի զրո

source: Horizontal margin between object base layer and raft contour.
hy_am: Առարկայի հիմքի և օժանդակ կոնտուրի հորիզոնական լուսանցքը

source: Resolution (deprecated)
hy_am: Տարալուծում (հնացած)

source: Minimum detail resolution, used to simplify the input file for speeding up the slicing job and reducing memory usage. High-resolution models often carry more detail than printers can render. Set to zero to disable any simplification and use full resolution from input.
hy_am: Մանրամասնությունների նվազագույն լուծաչափը, որն պարզեցնում է մուտքային նիշքը, արագացնում է կտրելու աշխատանքը և նվազեցնում է հիշողության օգտագործումը: Բարձր լուծաչափով մոդելները հաճախ ավելի շատ մանրամասներ են պարունակում, քան տպիչները կարող են վերլուծել: Զրո սահմանելու դեպքում գործառույթն կանջատվի։

source: Minimum travel after retraction
hy_am: Նվազագույն թռիչք հետ քաշումից հետ

source: Retraction
hy_am: Հետքաշում

source: Retraction is not triggered when travel moves are shorter than this length.
hy_am: Հետքաշումը չի գործարկվում, երբ թռիչքային շարժումներն տվյալ երկարությունից ավելի կարճ են:

source: Retract on layer change
hy_am: Հետ քաշել շերտի փոփոխության ժամանակ

source: This flag enforces a retraction whenever a Z move is done.
hy_am: Այս կետը ուժեղացնում է հետ քաշումը, երբ Z-ի շարժը կատարված է։

source: Length
hy_am: Երկարություն

source: When retraction is triggered, filament is pulled back by the specified amount (the length is measured on raw filament, before it enters the extruder).
hy_am: Երբ ետ քաշումը գործարկած է, լցանյութը հետ է քաշվում նշված քանակով (երկարությունը չափվում է չհալած նյուիթ վրա,նախքան դրա արտամղիչ գլխիկ մտնելը):

source: When retraction is triggered before changing tool, filament is pulled back by the specified amount (the length is measured on raw filament, before it enters the extruder).
hy_am: Երբ ետ քաշումը գործարկած է նախքան գործիքը փոխելը, լցանյութը հետ է սեղմվում նշված քանակով (երկարությունը չափվումէ չհալած նյութի վրա, դրա արտամղիչ գլխիկ մտնելը):

source: If you set this to a positive value, Z is quickly raised every time a retraction is triggered. When using multiple extruders, only the setting for the first extruder will be considered.
hy_am: Դրական արժեքի դեպքում Z-ն արագորեն կբարձրանա ամեն անգամ, երբ գործարկվում է հետկանչը: Մի քանի արտամղիչ գլխիկներ օգտագործելիս հաշվի է առնվում միայն առաջինի կարգավորումը

source: Above Z
hy_am: Ներքին Z

source: If you set this to a positive value, Z lift will only take place above the specified absolute Z. You can tune this setting for skipping lift on the first layers.
hy_am: Դրական արժեքի դեպքում Z-ի շարժը տեղի կունենա միայն նշված բացարձակ Z-ից բարձր: Սա կարող եք այնպես լավ կարգավորել, որ առաջին շերտերի բարձրացումը գրեթե բաց թողնվի:

source: Below Z
hy_am: Z֊ից ցածր

source: If you set this to a positive value, Z lift will only take place below the specified absolute Z. You can tune this setting for limiting lift to the first layers.
hy_am: Դրական արժեքի դեպքում Z֊ի բարձրացումը տեղի կունենա միայն նշված բացարձակ Z-ից ցածր: Սա կարող եք այնպես լավ կարգավորել, որ սահմանափակվի առաջին շերտերի բարձրացումը:

source: Extra length on restart
hy_am: Լրացուցիչ երկարություն վերագործարկման ժամանակ

source: When the retraction is compensated after the travel move, the extruder will push this additional amount of filament. This setting is rarely needed.
hy_am: Երբ նյութի հետ քաշումը կոմպեսացվում է թռիչքային քայլերից հետո, ապա գլխիկը սկսում է արտամղել միևնույն չափով լրացուցիչ քանակությամբ լցանյութ: Այս կարգավորումը հազվադեպ է անհրաժեշտ լինում:

source: When the retraction is compensated after changing tool, the extruder will push this additional amount of filament.
hy_am: Երբ նյութի հետ քաշումը կոմպեսացվում է գործիքը փոխելուց հետո, ապա գլխիկը սկսում է արտամղել լրացուցիչ քանակությամբ" "լցանյութ:

source: The speed for retractions (it only applies to the extruder motor). If you use the Firmware Retraction option, please note this value still affects the auto-speed pressure regulator.
hy_am: Նյութի հետ քաշելու արագությունը (դա վերաբերում է միայն գլխիկի շարժիչին): Եթե դուք օգտագործում եք ՆԾԱ֊ի հետ քաշելու տարբերակը, ապա պետք է նկատի ունենալ, որ այս արժեքը դեռևս ազդում է ճնշման կարգավորիչի ավտոմատ արագության վրա:

source: Seam position
hy_am: Հատման դիրքը

source: Position of perimeters starting points.
hy_am: Շրջագծերի մեկնարկման կետերի դիրքը

source: USB/serial port for printer connection.
hy_am: USB/հաջորդական կայանը տպիչի միացման համար։

source: Speed (baud) of USB/serial port for printer connection.
hy_am: USB/հաջորդական կայանի արագությունը (baud) տպիչին միանալու համար.

source: Distance from object
hy_am: Հեռավորությունը առարկայից

source: Distance between skirt and object(s). Set this to zero to attach the skirt to the object(s) and get a brim for better adhesion.
hy_am: Եզրագծի և առարկայի (առարկաների) միջև եղած հեռավորությունը: Զրոյի դեպքում՝ Եզրագիծը և առարկան(ները) կմիանան միմյանց և եզրերը կդարձնի ավելի կպչուն:

source: Skirt height
hy_am: Եզրագծի բարձրությունը

source: Height of skirt expressed in layers. Set this to a tall value to use skirt as a shield against drafts.
hy_am: Եզրագծի բարձրությունը՝ արտահայտված շերտերով։ Բարձր արժեքի դեպքում եզրագիծը կհանդիսանա որպես վահան ավելցուկային նյութի փոխարեն:

source: Loops (minimum)
hy_am: Օղակներ (նվազագույն)

source: Number of loops for the skirt. If the Minimum Extrusion Length option is set, the number of loops might be greater than the one configured here. Set this to zero to disable skirt completely.
hy_am: Օղակների քանակն եզրագծի համար։ Եթե «Նվազագույն արտամղման երկարություն» տարբերակը սահմանված է, ապա օղակների թիվը կարող է ավելի մեծ լինել, քան նախապես սահմանվածը: Զրոյի դեպքում եզրագիծն ամբողջությամբ կանջատվի:

source: Slow down if layer print time is below
hy_am: Դանդաղեցնել, եթե շերտի տպագրության ժամանակը ցածր է

source: If layer print time is estimated below this number of seconds, print moves speed will be scaled down to extend duration to this value.
hy_am: Եթե շերտի տպման ժամանակը գնայատվում է վարկյաններից ավելի ցածր, ապա տպագրության արագությունը կցածրանա և արդյունքում կմեծանա ժամանակը։

source: ↳ small
hy_am: ↳ փոքր

source: This separate setting will affect the speed of perimeters having radius <= 6.5mm (usually holes). If expressed as percentage (for example: 80%) it will be calculated on the perimeters speed setting above.
hy_am: Այս առանձին կարգավորումը ազդում է շրջագծերի արագության վրա, որոնք ունենք <= 6.5մմ շառավղով անցքեր։ Եթե ագրվում է տոկոսով, ապա այն կհաշվարկվի (օրինակ՝ 80%) ներքևում նշված շրջագծերի արագության վրա։

source: Solid infill threshold area
hy_am: Շեմային տարածքի կարծր լցոնում

source: Force solid infill for regions having a smaller area than the specified threshold.
hy_am: Պարտադրել կարծր լցոնում նշված շեմից ավելի փոքր տարածք ունեցող շրջանների համար:

source: Solid infill extruder
hy_am: Արտամղման կարծր լցոնում

source: The extruder to use when printing solid infill.
hy_am: Կարծր տպագրության ժամանակ օգտագործվող արտաղմղիչ գլխիկը։

source: Solid infill every
hy_am: Ամենուր կարծր լցոնում

source: This feature allows to force a solid layer every given number of layers. Zero to disable. You can set this to any value (for example 9999); Slic3r will automatically choose the maximum possible number of layers to combine according to nozzle diameter and layer height.
hy_am: Այն հատկությունը պարտադրում է կարծր լցոնում յուրաքանչյուր համարի շերրում։ Սահմանեք զրո անջատելու համար։ Կարող եք սա սահմանել ցանկացած արժեքի (օրինակ 9999); Slic3r-ը ինքնաբերաբար կընտրի շերտերի առավելագույն հնարավոր քանակությունը, համակցելով ըստ nozzle-ի տրամագծի և շերտի բարձրության:

source: ↳ solid
hy_am: ↳ կարծր

source: Set this to a non-zero value to set a manual extrusion width for infill for solid surfaces. If expressed as percentage (for example 90%) it will be computed over layer height.
hy_am: Սահմանեք սա զերո արժեք, եթե ցանկանում եք ունենալ ձեռքով կարծր մակերեսներ արտամղելու հնարավորություն։ Տոկոսով գրելու դեպքում (օրինակ՝ 90%) այն կհաշվարկվի շերտի բարձրության արժեքի հիմա վրա։

source: Speed for printing solid regions (top/bottom/internal horizontal shells). This can be expressed as a percentage (for example: 80%) over the default infill speed above.
hy_am: Կարծր տարածքները տպագրելու արագությունը (վերև/ներքև/ներքին հորիզոնական կաղապարներ): Սա կարող եք գրել տոկոսով (օրինակ՝ 80%) սահմանված վերոնշյալ լցոնման հիմնական արագությամբ:

source: Solid layers
hy_am: Պինդ շերտեր

source: Number of solid layers to generate on top and bottom surfaces.
hy_am: Կարծր շերտերի քանակը վերին և ներքին մակերեսների շերտերը գեներացնելու համար։

source: Spiral vase
hy_am: Պարուրաձև վազ

source: This feature will raise Z gradually while printing a single-walled object in order to remove any visible seam. This option requires a single perimeter, no infill, no top solid layers and no support material. You can still set any number of bottom solid layers as well as skirt/brim loops. It won't work when printing more than an object.
hy_am: Այս հատկությունը աստիճանաբար կբարձրացնի Z-ը մեկ շերտով առարկա տպելիս՝ տեսանելի հատումներն հեռացնելու համար: Այս տարբերակը պահանջում է մեկ շրջագիծ, առանց լցոնման, առանց վերին կարծր շերտերի և առանց օժանդակ նյութի: Նաև կարող եք սահմանել ներքևի պինդ շերտերի, ինչպես նաև շրջանի/եզրերի օղակներ ցանկացած քանակ: Այն չի աշխատի մեկից ավելի առարկա տպելիս:

source: Temperature variation
hy_am: Ջերմաստիճանի տարբերակում

source: Temperature difference to be applied when an extruder is not active. Enables a full-height "sacrificial" skirt on which the nozzles are periodically wiped.
hy_am: Ջերմաստիճանի տարբերությունը պետք է կիրառվի, երբ արտամղիչ գլխիկը ակտիվ չէ: Միանում է մինչև վերջ բարձրացած «զոհաբերող» եզրով, որի վրայով անցնելուց nozzle-ը պարբերաբար սրբվում են:

source: Start G-code
hy_am: G-կոդի մեկնարկ

source: This start procedure is inserted at the beginning, after bed has reached the target temperature and extruder just started heating, and before extruder has finished heating. If Slic3r detects M104, M109, M140 or M190 in your custom codes, such commands will not be prepended automatically so you're free to customize the order of heating commands and other custom actions. Note that you can use placeholder variables for all Slic3r settings, so you can put a "M109 S[first_layer_temperature]" command wherever you want.
hy_am: Այս մեկնարկի կարգը տեղադրվում է սկզբում, երբ հարթակը հասնում է նպատակային ջերմաստիճանին, և արտամղիչ գլխիկը դե նոր է սկսում տաքանալ, և մինչ դրա տաքացումը: Եթե Slic3r-ը հայտնաբերում է M104, M109, M140 կամ M190 Ձեր հատուկ կոդերում, ապա այդպիսի հրամաններն չեն տեղադրվի, այնպես որ դուք ազատ եք հարմարեցնել տաքացման հրամանների և այլ հատուկ գործողությունների հերթականությունը: Նկատի ունեցեք, որ կարող եք օգտագործել դաշտի հուշման տեղապահ փոփոխականները Slic3r-ի բոլոր կարգավորումների համար, այնպես որ կարող եք տեղադրել «M109 S[first_layer_temperature]» հրամանը, որտեղ որ կցանկանաք:

source: This start procedure is inserted at the beginning, after any printer start gcode. This is used to override settings for a specific filament. If Slic3r detects M104, M109, M140 or M190 in your custom codes, such commands will not be prepended automatically so you're free to customize the order of heating commands and other custom actions. Note that you can use placeholder variables for all Slic3r settings, so you can put a "M109 S[first_layer_temperature]" command wherever you want. If you have multiple extruders, the gcode is processed in extruder order.
hy_am: Այս մեկնարկի ընթացակարգը տեղադրվում է նիշքի սկզբում, անմիջապես տպիչի gcode-ի գործրարկումից հետո : Սա օգտագործվում է որոշակի լցանյութի պարամետրեր հեռացնելու համար: Եթե Slic3r-ը հայտնաբերում է M104, M109, M140 կամ M190 Ձեր հատուկ կոդերում, ապա այդպիսի հրամաններն ինքնաբերաբար չեն զետեղվում, ուստի ազատ եք հարմարեցնել տաքացման հրամաններն ու այլ հատուկ գործողությունների հերթականությունը: Նկատի ունեցեք, որ կարող եք օգտագործել տեղապահ փոփոխականները Slic3r-ի բոլոր կարգավորումների համար, այնպես որ կարող եք տեղադրել «M109 S[first_layer_temperature]» հրամանը, որտեղ որ կցանկանաք: Եթե ունեք մի քանի արտամղիչ գլխիկներ, ապա gcode-ը կմշակվի դրանց հերթականությամբ:

source: Generate support material
hy_am: Գեներացնել օժանդակ նյութ

source: Enable support material generation.
hy_am: Միացնել օժանդակ նյութի գեներացումը

source: Pattern angle
hy_am: Ձևանմուշի անկյունը

source: Use this setting to rotate the support material pattern on the horizontal plane.
hy_am: Օգտագործել այս կարգավորումն օժանդակ նյութի ձևը հորիզոնական պտտելու համար։

source: Support on build plate only
hy_am: Աջակցել միայն կառուցված հարթակը

source: Only create support if it lies on a build plate. Don't create support on a print.
hy_am: Օժանդակ նյութը արտածել միայն այն դեպքում, եթե այն գտնվում է հարթակի դաշտում։ Տպածի վրա օժանդակ նյութ չստեղծել։

source: Contact Z distance
hy_am: Z ֊ի հեռավորությունը կապը

source: The vertical distance between object and support material interface. Setting this to 0 will also prevent Slic3r from using bridge flow and speed for the first object layer.
hy_am: Ուղղահայաց հեռավորությունը առարկայի և օժանդակ նյութի դիմերեսի միջև: 0-ի դեպքում Slic3r-ին թույլ չի տա օգտագործել կամրջի հոսքը և արագությունն առաջին առարկայի շերտի համար:

source: Enforce support for the first
hy_am: Օժանդակը ամենասկզբից
