Repository: slic3r/Slic3r
Catalog: translation/*.po
Languages: hy_am

source: Generate support material for the specified number of layers counting from bottom, regardless of whether normal support material is enabled or not and regardless of any angle threshold. This is useful for getting more adhesion of objects having a very thin or poor footprint on the build plate.
hy_am: Ստեղծել օժանդակ նյութ ներքևից հաշվվող շերտերի նշված քանակի համար, անկախ նրանից օժանդակ նյութը միացված է, թե ոչ, և անկախ անկյան շեմից: Սա օգտակար է այնպիսի հարթակների համար, որոնց վրա առարկանները ունեն կպչունության խնդիր:

source: Support material/raft/skirt extruder
hy_am: Օժանդակ նյութի/հավելյալի/եզրագծի արտամղում

source: The extruder to use when printing support material, raft and skirt.
hy_am: Օժանդակ նյութն օգտագործելու արտամղիչ գլխիկը, ավելցուկային նյութն ու եզրագիծը

source: Set this to a non-zero value to set a manual extrusion width for support material. If expressed as percentage (for example 90%) it will be computed over layer height.
hy_am: Զրոյական արժեքի դեպքում արտամղման լայնությունը կարող եք սահմանելու ձեռքով: Եթե գրեք տոկոսով (օրինակ՝ 90%), ապա այն կհաշվարկվի շերտի բարձրության վրա:.

source: Support material/raft interface extruder
hy_am: Օժանդակ նյութ/ավելցուկային մակերեսների արտամղում

source: The extruder to use when printing support material interface. This affects raft too.
hy_am: Օժանդալ նյութի մակերեսները տպագրող արտամղիչ գլխիկը։ Սա շատ է ազդում աջակցող նյութի վրա։

source: Interface layers
hy_am: Մակերեսային շերտեր

source: Number of interface layers to insert between the object(s) and support material.
hy_am: Օժանդակ նյութի և առարկայի միջև զետեղվող մակերեսային շերտերի քանակը։

source: Interface pattern spacing
hy_am: Մակերեսային նախշերի տարածումը

source: Spacing between interface lines. Set zero to get a solid interface.
hy_am: Մակերեսային գծերի միջտարածությունը։ Սահմանեք զերո կարծր մակերեսներ ունենալու համար։

source: ↳ interface
hy_am: ↳ մակերես

source: Interface Speed
hy_am: Մակերեսի արագությունը

source: Support material interface speed
hy_am: Մակերեսային շերտերի օժանդակ նյութի արագությունը

source: Speed for printing support material interface layers. If expressed as percentage (for example 50%) it will be calculated over support material speed.
hy_am: Մակերեսային շերտերի օժանդակ նյոթւ տպագրման արագությունը։ Եթե գրեք տոկոսով (օրինակ՝ 50%), ապա այն կհաշվարկվի օժանդակ նյութի արագության վրա։

source: Pattern
hy_am: Ձևանմուշ

source: Pattern used to generate support material.
hy_am: Ձևանմուշ,որի հիման վրա կգեներացվի օժանդակ նյութը

source: Pattern spacing
hy_am: Ձևանմուշի տարածությունը

source: Spacing between support material lines.
hy_am: Օժանդակ նյութի գծերի միջև եղած տարածքը։

source: Speed for printing support material.
hy_am: Օժանդակ նյութը տպագրելու արագությունը։

source: Overhang threshold
hy_am: Գերկախյալ շեմ

source: Support material will not be generated for overhangs whose slope angle (90° = vertical) is above the given threshold. In other words, this value represent the most horizontal slope (measured from the horizontal plane) that you can print without support material. Set to a percentage to automatically detect based on some % of overhanging perimeter width instead (recommended).
hy_am: Օժանդակ նյութ չի ստեղծվի այն շեմերի համար, որոնց թեքության անկյունը (90° = ուղղահայաց) նշված շեմից բարձր է: Այլ կերպ ասած, այս արժեքը ներկայացնում է ամենահորիզոնական թեքությունը (չափված հորիզոնական հարթությունից),և այդ դեպքում կարող եք տպել առանց օժանդակ նյութի: Տոկոսով սահմանելու դեպքում slic3r-ը ինքնաբերաբար կհայտնաբերի որոշ պարագծերի % o լայնությունը (խորհուրդ է տրվում)։

source: Extruder temperature for layers after the first one. Set this to zero to disable temperature control commands in the output.
hy_am: Արտամղիչ գլխիկի ջերմաստիճանը առաջին շերտից հետո։ Զրո սահմանելու դեպքում ջերմաստիճանի կառավարումը կանջատվի։

source: Detect thin walls
hy_am: Հայտանբերել բարակ պատերը

source: Detect single-width walls (parts where two extrusions don't fit and we need to collapse them into a single trace).
hy_am: Հայտնաբերել մեկ միավոր լայնությամբ պատեր (պատեր, որտեղ երկու արտամղիչները չեն տեղավորվում, և պետքէ դրանք լցնել մեկ փոսի մեջ)

source: Threads are used to parallelize long-running tasks. Optimal threads number is slightly above the number of available cores/processors.
hy_am: Threads-ն օգտագործվում են երկարաժամկետ առաջադրանքները զուգահեռ իրագործելու համար: Սրանց օպտիմալ թիվը միփոքր ավելի բարձր է քան համակարգչի միջուկների/պրոցեսորների թիվը:.

source: Tool change G-code
hy_am: Գործիքի փոփոխման G-code

source: This custom code is inserted right before every extruder change. Note that you can use placeholder variables for all Slic3r settings as well as [previous_extruder] and [next_extruder].
hy_am: Այս հատուկ կոդը զետեղվում է անմիջապես աջ արտամղիչի յուրաքանչյուր փոփոխության դեպքում: Նկատի ունեցեք,որ դուք կարող եք օգտագործել տեղապահ/placeholder փոփոխականները Slic3r-ի բոլոր կարգավորումների, ինչպեսնաև [previous_extruder] և [next_extruder] համար:

source: ↳ top solid
hy_am: ↳ վերին կարծր

source: Set this to a non-zero value to set a manual extrusion width for infill for top surfaces. You may want to use thinner extrudates to fill all narrow regions and get a smoother finish. If expressed as percentage (for example 90%) it will be computed over layer height.
hy_am: Ոչ զրոյական արժեքի դեպքում կարող եք ձեռքով սահմանել արտամղման հաստությունը վերին մակերևույթների լցոնման համար:Ավելի բարակ արտամղումներ դեպքում կունենանք լցոնում նեղ շրջանները համար ու կստանաք ավելի հարթ ծածկույթ:Եթե գրվի տոկոսով (օրինակ՝ 90%),ապա այն կհաշվարկվի շերտի բարձրության վրա

source: Top
hy_am: Վերին

source: Infill pattern for top layers. This only affects the external visible layer, and not its adjacent solid shells.
hy_am: Լցոնման նախշը վերին շերտերի համար: Սա ազդում է միայն արտաքին տեսանել

source: Speed for printing top solid layers (it only applies to the uppermost external layers and not to their internal solid layers). You may want to slow down this to get a nicer surface finish. This can be expressed as a percentage (for example: 80%) over the solid infill speed above.
hy_am: Վերին պինդ շերտերի տպման արագությունը (դա վերաբերում է միայն ամենավերին արտաքին շերտերին և ոչ թե դրանիցներքև գտնվող պինդ շերտերին): Սա դանդաղեցնելով կունանեք արտաքին մակերեսի ավելի գեղեցիկ տեսք: Այն կարող էարտահայտվել տոկոսով (օրինակ՝ 80%):

source: Number of solid layers to generate on top surfaces.
hy_am: Վերին մակերևույթների վրա առաջացող պինդ շերտերի քանակը:

source: Travel
hy_am: Դատարկ ցատկ

source: Speed for travel moves (jumps between distant extrusion points).
hy_am: Դատարկ տեղափոխման շարժման արագությունը (ցատկի հեռավորությունը արտամղման կետերի միջև)։

source: Use firmware retraction
hy_am: Օգտագործել ներքին ծրագրի հետքաշումը

source: This experimental setting uses G10 and G11 commands to have the firmware handle the retraction. This is only supported in recent Marlin.
hy_am: Այս փորձարարական կարգավորումն օգտագործում է G10 և G11 հրամաններ, որը firmware֊ին հնարավորություն է տալիսլցանյութը հետ քաշել (retraction): Սա աշխատում է միայն Marlin-ի վերջին տարբերակում:

source: Use relative E distances
hy_am: Օգտագործել հարաբերական E հեռավորություններ

source: If your firmware requires relative E values, check this, otherwise leave it unchecked. Most firmwares use absolute values.
hy_am: Եթե ձեր ՆԾԱ֊ն պահանջում է հարաբերական E արժեքներ, նշեք այս կետը, հակառակ դեպքում թողեք այն չնշած: ՀիմնականՆԾԱ֊ներն օգտագործում են բացարձակ արժեքներ:

source: Use volumetric E
hy_am: Օգտագործել ծավալային E

source: This experimental setting uses outputs the E values in cubic millimeters instead of linear millimeters. If your firmware doesn't already know filament diameter(s), you can put commands like 'M200 D[filament_diameter_0] T0' in your start G-code in order to turn volumetric mode on and use the filament diameter associated to the filament selected in Slic3r. This is only supported in recent Marlin.
hy_am: Այս փորձարարական գործառույթն օգտագործում է E արժեքների ելքը, ոչ թե գծային այլ խորանարդ միլիմետրերով:Եթե ձեր տպիչի ՆԾԱ/firmware-ն դեռ չունի լցանյութի տրամագիծ(ներ)ն, ապա դուք կարող եք զետեղել«M200 D[filament_diameter_0] T0» հրամանը Gcode-ի սկզբում, որը կմիացնի ծավալային ռեժիմը և կօգտագործիSlic3r֊ում նշված լցանյութի տրամագիծը: Այս ֆունկցիան աշխատում է միայն Marlin-ի վերջին տարբերակում:

source: Vibration limit (deprecated)
hy_am: Վիբրացիոն սահմանանափակում (անօգտակար)

source: This experimental option will slow down those moves hitting the configured frequency limit. The purpose of limiting vibrations is to avoid mechanical resonance. Set zero to disable.
hy_am: Այս փորձնական տարբերակը կդանդաղեցնի այն շարժումները, որոնք հասնում են որոշակի հաճախականության սահմանին:Վիբրացիաները սահմանափակելով կխուսափենք մեխանիկական ռեզոնանսներից։ Անջատելու համար սահմանեք զրո արժեք:

source: Wipe while retracting
hy_am: Սրբել հետ քաշելիս

source: This flag will move the nozzle while retracting to minimize the possible blob on leaky extruders.
hy_am: Այս ընտրանքը կշարժի nozzle֊ը, միևնույն ժամանակ տեղի կունենա լցանյութի հետ շարժ, որը նվազագույնչափի կհասցնի արտահոսող գլխիկի ծայրին հավաքվող գնդիկները:

source: XY Size Compensation
hy_am: XY չափի փոխհատուցում

source: The object will be grown/shrunk in the XY plane by the configured value (negative = inwards, positive = outwards). This might be useful for fine-tuning hole sizes.
hy_am: Առարկան կմեծացվի/փոքրացվի XY հարթությունում կարգավորված արժեքով (բացասական = դեպի ներս, դրական = դեպի դուրս):Սա կարող է օգտակար լինել անցքերի չափսերը ֆիքսելու համար:

source: Z offset
hy_am: Z֊ի զրոյական

source: This value will be added (or subtracted) from all the Z coordinates in the output G-code. It is used to compensate for bad Z endstop position: for example, if your endstop zero actually leaves the nozzle 0.3mm far from the print bed, set this to -0.3 (or fix your endstop).
hy_am: Այս արժեքը կավելանա (կամ կհանվի) ելքային Gcode-ի բոլոր Z կոորդինատներից: Այն փոխհատուցում է Z endstop/կանգնակի վատ դիրքը։Օրինակ, եթե ձեր կանգնակի զրոն թողնում է, որ nozzle֊ը հարթակից գտնվի 0,3 մմ հեռավորության վրա, ապա անհրաժեշտ էայս գործակիցը սահմանել -0,3 (կամ կարող եք հենց ֆիզիկապես ուղղել կանգնակը):

source: Z full steps/mm
hy_am: Z֊ի լիարժեք քայլ/մմ

source: Set this to the number of *full* steps (not microsteps) needed for moving the Z axis by 1mm; you can calculate this by dividing the number of microsteps configured in your firmware by the microstepping amount (8, 16, 32). Slic3r will round your configured layer height to the nearest multiple of that value in order to ensure the best accuracy. This is most useful for machines with imperial leadscrews or belt-driven Z or for unusual layer heights with metric leadscrews. Set to zero to disable this experimental feature.
hy_am: Սահմանվում է *ամբողջ* քայլերի (ոչ թե միկրոքայլերի) քանակի վրա, որոնք անհրաժեշտ են Z առանցքը 1 մմ-ով տեղափոխելու համար:Կարող եք դա հաշվարկել՝ բաժանելով այն ձեր միկրոքայլերի քանակի վրա, որը կարգավորվում է «միկրոքայլերի ծավալ»ֆունկցիայով ՆԾԱ/firmware֊ի մեջ (8, 16, 32): Slic3r-ը կկլորացնի ձեր կարգավորված շերտի բարձրությունը մինչև այդ արժեքի մոտակա" "բազմապատիկը, որպեսզի ապահովի լավագույն ճշգրտությունը: Սա առավել օգտակար է կայսերական պտուտակներով կամ Z գոտիով շարժվող " "մեքենաների կամ մետրային կապող պտուտակներով շերտի անսովոր բարձրությունների դեպքում: Զերո արժեքի դեպքում այս փորձնական" "գործառույթն կանջատվի

source: Cut
hy_am: Կտրել

source: Cut model at the given Z.
hy_am: Կտրել մոդելը տրված Z֊ի վրա։

source: Cut model in the XY plane into tiles of the specified max size.
hy_am: Կտրել մոդելի XY հարթությունը սալիկների նշված առավելագույն չափով։

source: Cut model at the given X.
hy_am: Կտրել մոդելը տրված X֊ի վրա։

source: Cut model at the given Y.
hy_am: Կտրել մոդելը տրված Y֊ի վրա։

source: Export SVG
hy_am: Արտահանել SVG

source: Export the model as OBJ.
hy_am: Արտահանել մոդելն որպես OBJ.

source: Export POV
hy_am: Արտահանել POV

source: Export the model as POV-Ray definition.
hy_am: Արտահանել մոդելն, որպես POV-Ray սահմանում։

source: Slice the model and export slices as SVG.
hy_am: Շերտազատել մոդելը և արտահանել որպես SVG։

source: Output Model Info
hy_am: Ելքային մոդելի տվյալները

source: Write information about the model to the console.
hy_am: Մոոդելի մասին տվյալները գրառել կոնսոլում

source: Load config file
hy_am: Բեռնել կարգավորման նիշքը

source: Load configuration from the specified file. It can be used more than once to load options from multiple files.
hy_am: Բեռնել կարգաբերման նիշքն այստեղից։ Այն կարող է օգտագործվել մեկից ավել անգամ՝ մի շարք նիշքերից ներմուծելու համար

source: Output File
hy_am: Ելքային նիշք

source: The file where the output will be written (if not specified, it will be based on the input file).
hy_am: Նիշք, որտեղ կգրվի ելքը (եթե չի հստակեցվում, ապա այն կգրվի ներմուծման նիշքում ).

source: Rotate
hy_am: Պտտել

source: Rotation angle around the Z axis in degrees (0-360, default: 0).
hy_am: Պտտման անկյունը Z կորդինատի շուրջը աստիճաններով (0-360, լռելայն՝ 0)։

source: Rotate around X
hy_am: Պտտել X-ի շուրջը

source: Rotation angle around the X axis in degrees (0-360, default: 0).
hy_am: Պտտման անկյունը X կորդինատի շուրջը աստիճաններով (0-360, լռելայն՝ 0)։

source: Rotate around Y
hy_am: Պտտել Y֊ի շուրջը

source: Rotation angle around the Y axis in degrees (0-360, default: 0).
hy_am: Պտտման անկյունը Y կորդինատի շուրջը աստիճաններով (0-360, լռելայն՝ 0)։

source: Save config file
hy_am: Պահել կարգավորման նիշքը

source: Save configuration to the specified file.
hy_am: Պահել կարգաբերումը կոնկրետ նիշքում

source: Scale
hy_am: Կիրառել չափը

source: Scaling factor (default: 1).
hy_am: Չափափոխման գործակիցը (լռելայն՝ 1).

source: Scale to Fit
hy_am: Փոխել չափը հարմար ձևով

source: Scale to fit the given volume.
hy_am: Փոխել չափը՝ տրված ծավալին համապատասխանելու համար:
