Repository: slic3r/Slic3r
Catalog: translation/*.po
Languages: hy_am

source: Rectilinear
hy_am: Ուղղանկյունաձև

source: Concentric
hy_am: Կենտրոնաձև

source: Hilbert Curve
hy_am: Հիլբերտյան կոր

source: Archimedean Chords
hy_am: Արքիմեդյան ակորդ

source: Octagram Spiral
hy_am: Ութաթև պարույր

source: Avoid crossing perimeters
hy_am: Խուսափել խաչվող պարագծերից

source: Layers and Perimeters
hy_am: Շերտեր և պարագծեր

source: Optimize travel moves in order to minimize the crossing of perimeters. This is mostly useful with Bowden extruders which suffer from oozing. This feature slows down both the print and the G-code generation.
hy_am: Օպտիմալացնում է դատարկ տեղաշարժերը և թույլ է տալիս կրճատել խաչվող պարագծերը: Սա շատ օգտակար է, հատկապես երբ օգտագործում ենք Bowden տեսակի արտամղիչ գլխիկներ(extruder), քանի որ վերջիններս ունեն լցանյութը ծորելու թերություն. Այս հատկությունը դանդաղեցնում է ինչպես բուն տպագրությունն, այնպես էլ Gcode-ի պատրաստման ընթացքը:

source: Bed shape
hy_am: Հարթակի ձևը

source: Has heated bed
hy_am: Հարթակն ունի տաքացման հնարավորություն

source: Unselecting this will suppress automatic generation of bed heating gcode.
hy_am: Այս կետը չնշելու դեպքում հարթակի տաքացման gcode-ը ինքնաբերաբար կգեներեացվի

source: Other layers
hy_am: Այլ շերտեր

source: Bed temperature for layers after the first one.
hy_am: Հարթակի ջերմաստիճանը առաջին շերտից հետո:

source: Bed temperature
hy_am: Հարթակի ջերմաստիճանը

source: Before layer change G-code
hy_am: Շերտից առաջ փոխել G-code-ը

source: This custom code is inserted at every layer change, right before the Z move. Note that you can use placeholder variables for all Slic3r settings as well as [layer_num] and [layer_z].
hy_am: Այս հատուկ կոդը տեղադրվում է յուրաքանչյուր շերտի փոփոխության ժամանակ, անմիջապես Z-ի քայլից առաջ։Նաև կաարող եք օգտագործել, որպես տեղապահ (placeholder) տեքստի փոփոխականները Slic3r-ի բոլոր կարգավորումների,ինչպես նաև [layer_num]֊ի և [layer_z]֊ի համար:

source: Bottom
hy_am: Հիմք

source: Bottom infill pattern
hy_am: Հիմքը լցնելու ձևաչափը

source: Infill
hy_am: Նյութի լցոնում

source: Infill pattern for bottom layers. This only affects the external visible layer, and not its adjacent solid shells.
hy_am: Լցոնման ձևաչափը հիմքի շերտերի համար: Այն միայն ազդում է արտաքին տեսանելի շերտերի վրա, բայց ոչ հարակից պինդ կաղապարների վրա:

source: Number of solid layers to generate on bottom surfaces.
hy_am: Պինդ շերտերի քանակը, որոնց միջոցով պետք է ստեղծել հիմքի մակերևույթները:

source: Bottom solid layers
hy_am: Հիմքի պինդ շերտեր

source: Bridge
hy_am: Կամուրջ

source: Speed > Acceleration
hy_am: Արագություն > Արագացում

source: This is the acceleration your printer will use for bridges. Set zero to disable acceleration control for bridges.
hy_am: Սա տպիչի արագացումն է կամրջակների ժամանակ: 0-ի դեպքում անջատում է կամրջակների պատրաստման արագացումը:

source: Bridges fan speed
hy_am: Օդափոխիչի արագությունը կամրջակների ժամանակ

source: This fan speed is enforced during all bridges and overhangs.
hy_am: Օդափոխիչի արագությունը սկսում է աճել բոլոր տեսակի կամուրջների և արագ անցումների ժամանակ:

source: Bridge flow ratio
hy_am: Կամուրջի հոսքի հարաբերակցություըն

source: Advanced
hy_am: Մանսագիտացված

source: This factor affects the amount of plastic for bridging. You can decrease it slightly to pull the extrudates and prevent sagging, although default settings are usually good and you should experiment with cooling (use a fan) before tweaking this.
hy_am: Այս գործակիցը ազդում է կամրջման պլաստիկի քանակի վրա։ Կարող եք մի փոքրնվազեցնել այն՝ ձգելով արտամղիչ գլխիկը, թեև զրոյական դրված կարգավորումները սովորաբարլավն են։ Այս դեպքում նախքան այն կարգավորելը պետք է փորձարկել հովացման համակարգը (օգտագործեք օդափոխիչ)

source: Bridges
hy_am: Կամուրջներ

source: Speed
hy_am: Արագություն

source: Speed for printing bridges.
hy_am: Կամուրջների տպման արագություն:

source: Brim connections width
hy_am: Հիմքի ամրանների միացումերի լայնությունը

source: Skirt and brim
hy_am: Եզր և ամրան

source: If set to a positive value, straight connections will be built on the first layer between adjacent objects.
hy_am: Եթե սահմանված է դրական արժեքա, ապա ուղիղ կապերը կկառուցվեն առաջին շերտի վրա հարակից օբյեկտների միջև:

source: Exterior brim width
hy_am: Արտաքին ամրանի հաստությունը

source: Horizontal width of the brim that will be printed around each object on the first layer.
hy_am: Եզրի հորիզոնական լայնության չափը։ Այն սովորաբար տպում է յուրաքանչյուր առարկայի շուրջմեկնարկի ժամանակ։

source: Compatible printers
hy_am: Համատեղելի տպիչներ

source: Complete individual objects
hy_am: Լրացնել առանձին առարկանները

source: When printing multiple objects or copies, this feature will complete each object before moving onto next one (and starting it from its bottom layer). This feature is useful to avoid the risk of ruined prints. Slic3r should warn and prevent you from collisions, but beware.
hy_am: Բազմաթիվ առարկաներ կամ պատճեններ տպելիս այս հատկությունը կլրացնի յուրաքանչյուր առարկան՝նախքան հաջորդին անցնելը (սկսելով ստորին շերտից): Այս հատկությունը օգտակար է խոտանված տպագրությանվտանգից խուսափելու համար: Slic3r-ը պետք է զգուշացնի և կանխի extruder֊ի խափանումներից։Բայց զգուշ եղեք։

source: Enable auto cooling
hy_am: Միացնել ինքնահովացումը

source: This flag enables the automatic cooling logic that adjusts print speed and fan speed according to layer printing time.
hy_am: Այս դրոշակը հնարավորություն է տալիս ունենալ ինքնասառեցման որոշակի տրամաբանություն,որը կարգավորում է տպելու և օդափոխիչի արագությունը՝ շերտի տպագրության ժամանակից կախված։

source: Default
hy_am: Լռելայն

source: This is the acceleration your printer will be reset to after the role-specific acceleration values are used (perimeter/infill). Set zero to prevent resetting acceleration at all.
hy_am: Սա այն արագացումն է, որով տպիչը կմեկնարկի, երբ օգտագործվի հատուկ արագացմանարժեքների (պարագիծ/լցոնում): Սահմանեք զրո, որի դեպքում կկանխեք արագացման բոլորտեսակի սահմանումները:

source: Disable fan for the first
hy_am: Առաջին հերթին անջատել օդափոխիչը

source: This disables the fan completely for the first N layers to aid in the adhesion of media to the bed. (default 3)
hy_am: Սա ամբողջովին անջատում է օդափոխիչը, որը օգնում է առաջին N քանակի շերտերըհետշությամբ կպչեն հարթակին: (լռելայն սահմանված է 3)

source: layers
hy_am: շերտեր

source: Don't support bridges
hy_am: Կամուրջներ առանց օժանդակման

source: Support material
hy_am: Օժանդակ նյութ

source: Experimental option for preventing support material from being generated under bridged areas.
hy_am: Փորձնական տարբերակ՝ կամրջակների տարածքում օժանդակ նյութի լցոնումը կանխելու համար

source: Distance between copies
hy_am: Հեռավորությունը պատճենների միջև

source: Distance used for the auto-arrange feature of the plater.
hy_am: Հեռավորություն, որն օգտագործվում է հարթակի ինքնադասավորության համար

source: End G-code
hy_am: Գլխիկի G-code

source: This end procedure is inserted at the end of the output file. Note that you can use placeholder variables for all Slic3r settings.
hy_am: Այս վերջնական ընթացակարգը տեղադրվում է ելքային նիշքի վերջին մասում: Նկատի ունեցեք, որ Slic3r-իբոլոր տեսակի կարգավորումների համար կարող եք օգտագործել տեղապահ փոփոխականներ:

source: This end procedure is inserted at the end of the output file, before the printer end gcode. Note that you can use placeholder variables for all Slic3r settings. If you have multiple extruders, the gcode is processed in extruder order.
hy_am: Վերջնական ընթացակարգը տեղադրվում է ելքային նիշքում՝ տպիչի end gcode-ից առաջ: Նկատի ունեցեք,որ Slic3r-ի բոլոր կարգավորումների համար կարող եք օգտագործել տեղապահ փոփոխականներ:Եթե ունեք մի քանի գլխիկ, ապա gcode-ը մշակվում է գլխիկների հերթականությամբ:

source: Top/bottom fill pattern
hy_am: Վերև/ներքևի լցոնման ոճը

source: Fill pattern for top/bottom infill. This only affects the external visible layer, and not its adjacent solid shells.
hy_am: Լրացրեք վերևի/ներքևի լցոնման ոճը: Այն ազդում է միայն արտաքին տեսանելի շերտի վրա,և ոչ նրա հարակից ամուր պատյանների վրա:

source: ↳ external
hy_am: ↳ արտաքին

source: External perimeters extrusion width
hy_am: Արտաքին պարագծերի արտամղող լայնությունը

source: Extrusion Width
hy_am: Արտամղման լայնությունը

source: Set this to a non-zero value to set a manual extrusion width for external perimeters. If auto is chosen, a value will be used that maximizes accuracy of the external visible surfaces. If expressed as percentage (for example 200%) it will be computed over layer height.
hy_am: Սահմանել ոչ զրոյական արժեք, որով կգործադրվի արտաքին պարագծերի արտամղման լայնությունը:Եթե ընտրեք ինքնին տարբերակաը, ապա կօգտագործվի մի արժեք, որն առավելագույնի կհասցնիարտաքին տեսանելի մակերեսների ճշգրտությունը: Եթե գրվի որպես տոկոս (օրինակ 200%), ապա այնկհաշվարկվի շերտի բարձրության վրա

source: External perimeters speed
hy_am: Արտաքին պարագծերի արագությունը

source: This separate setting will affect the speed of external perimeters (the visible ones). If expressed as percentage (for example: 80%) it will be calculated on the perimeters speed setting above.
hy_am: Այս առանձին կարգավորումը կազդի արտաքին պարագծերի (տեսանելիների) արագության վրա:Եթե գրվում է որպես տոկոս (օրինակ՝ 80%), ապա այն կհաշվարկվի վերը նշված պարագծայինարագության կարգավորման նկատմամբ:

source: External perimeters first
hy_am: Արտաքին պարագծերը առաջին հերթին

source: Print contour perimeters from the outermost one to the innermost one instead of the default inverse order.
hy_am: Տպել շրջանակի պարագծերը ամենահեռավորից մինչև ամենամոտը,հակադարձ կարգի փոխարեն:

source: Extra perimeters if needed
hy_am: Հավելյալ պարագծեր, եթե անրաժեշտ է

source: Add more perimeters when needed for avoiding gaps in sloping walls.
hy_am: Անհրաժեշտության դեպքում ավելացնում է ավելի շատ պարագծեր,որը թույլ է տալիս խուսափել թեք պատերից:

source: Extruder
hy_am: Գլխիկ

source: Extruders
hy_am: Գլխիկներ

source: The extruder to use (unless more specific extruder settings are specified).
hy_am: Օգտագործվող գլխիկը (բացառությամբ այն դեպքերի, երբ գլխիկի համար կոնկրետկարգավորումները նշված չեն):

source: Height
hy_am: Բարձրություն

source: Set this to the vertical distance between your nozzle tip and (usually) the X carriage rods. In other words, this is the height of the clearance cylinder around your extruder, and it represents the maximum depth the extruder can peek before colliding with other printed objects.
hy_am: Սա սահմանում է nozzle ծայրի և (սովորաբար) X սայլի ձողերի միջև ուղղահայաց հեռավորությունը:Այլ կերպ ասած, սա գլխիկի բացթողնման մխոցի բարձրությունն է, և ներկայացնում էառավելագույն խորությունը, որ գլխիկը կարող է իջնել, առանց տպագիր առարկաների հետ բախվելու:

source: Radius
hy_am: Շառավիղ

source: Set this to the clearance radius around your extruder. If the extruder is not centered, choose the largest value for safety. This setting is used to check for collisions and to display the graphical preview in the plater.
hy_am: Սահմանում է գլխիկի շրջակա շառավղի թողունակությունը: Եթե գլխիկը կենտրոնացած չէ,ապա անվտանգության համար կարող եք ընտրել ամենամեծ արժեքը: Այս կարգավորումըօգտագործվում է բախումները ստուգելու և հարթակի վրա գրաֆիկական նախադիտումը ցուցադրելու համար:

source: Extruder offset
hy_am: Արտամղիչ գլխիկի զրոն

source: If your firmware doesn't handle the extruder displacement you need the G-code to take it into account. This option lets you specify the displacement of each extruder with respect to the first one. It expects positive coordinates (they will be subtracted from the XY coordinate).
hy_am: Եթե ապարատուրային ծրագիրը չի շարժում գլխիկն, ապա անհրաժեշտ է վերանայել G-կոդը:Այս տարբերակը թույլ է տալիս հատկանշել յուրաքանչյուր գլխիկի տեղաշարժը առաջինի նկատմամբ:Այն նախատեսված է դրական կոորդինատների համար (կպակասեցվեն XY կոորդինատներից):

source: Extrusion axis
hy_am: Արտամղման առանցքը

source: Use this option to set the axis letter associated to your printer's extruder (usually E but some printers use A).
hy_am: Օգտագործեք այս տարբերակը՝ տպիչի գլխիկի առանցքի տառը սահմանելու համար(սովորաբար E, բայց որոշ տպիչներ օգտագործում են A):

source: Extrusion multiplier
hy_am: Արտամղման բազմապատկիչ

source: This factor changes the amount of flow proportionally. You may need to tweak this setting to get nice surface finish and correct single wall widths. Usual values are between 0.9 and 1.1. If you think you need to change this more, check filament diameter and your firmware E steps.
hy_am: Այս գործակիցը համամասնորեն փոխում է հոսքի չափը: Երբեմն անհրաժեշտ է գործադրելայս հատկությունը՝ գեղեցիկ հարդարված հարթություն ստանալու և մեկ պատի լայնությունըշտկելու համար: Սովորական արժեքները 0.9-ից 1.1-ի միջև են: Եթե կարծում եք, որ պետքայն շատացնել, ապա ստուգեք լցանյութի տրամագիծը և ապարատուրային ծրագրի E֊ի քայլերը:

source: Default extrusion width
hy_am: Լռելայն արտամղման լայնությունը

source: Set this to a non-zero value to set a manual extrusion width. If expressed as percentage (for example: 230%) it will be computed over layer height.
hy_am: Սահմանել ոչ զրոյական արժեք, որը թույլ կտա ձեռքով փոփոխել արտամղման լայնությունը:Եթե գրվի տոկոսով (օրինակ՝ 230%), ապա այն կհաշվարկվի շերտի բարձրության վրա:

source: Keep fan always on
hy_am: Օդամղիչը միշտ միացրած պահել

source: If this is enabled, fan will never be disabled and will be kept running at least at its minimum speed. Useful for PLA, harmful for ABS.
hy_am: Եթե սա միացված է, օդափոխիչը երբեք չի անջատվի և կշարունակվի աշխատել նույնիսկնվազագույն արագությամբ: Օգտակար է PLA-ի համար, վնասակար՝ ABS-ի համար:

source: Enable fan if layer print time is below
hy_am: Միացնել օդափոխիչը, եթե շերտի տպման ժամանակը փոքր է

source: If layer print time is estimated below this number of seconds, fan will be enabled and its speed will be calculated by interpolating the minimum and maximum speeds.
hy_am: Եթե շերտի տպման ժամանակը գնահատվում է այսքան վայրկյանից ցածր, օդափոխիչը կմիանաու վերջինիս արագությունը կհաշվարկվի նվազագույն և առավելագույն արագությունների միջակայքում:

source: Color
hy_am: Գույն

source: This is only used in the Slic3r interface as a visual help.
hy_am: Սա օգտագործվում է միայն Slic3r֊ի միջերեսում, որպես տեսողական օգնություն:

source: Filament notes
hy_am: Լցանյութի նշումներ

source: You can put your notes regarding the filament here.
hy_am: Լցանյութի վերաբերյալ նշումները կարող եք տեղադրել այստեղ։

source: Max volumetric speed
hy_am: Առավելագույն ծավալային արագություն

source: Maximum volumetric speed allowed for this filament. Limits the maximum volumetric speed of a print to the minimum of print and filament volumetric speed. Set to zero for no limit.
hy_am: Առավելագույն ծավալային արագություն այս լցանյութի համար: Սահմանափակում էլցանյութի առավելագույն և նվազագույն ծավալային արագությունները տպագրությանժամանակ: Սահմանեք զրո, եթե չեք ուզում ունենալ սահմանափակումներ:

source: Diameter
hy_am: Տրամագիծ

source: Enter your filament diameter here. Good precision is required, so use a caliper and do multiple measurements along the filament, then compute the average.
hy_am: Մուտքագրեք լցանյութի տրամագիծն այստեղ: Պահանջվում է գրել ճշգրիտ թիվ։ Անհրաժեշտ էմի քանի անգամ չափումներ կատարել լցանյութի երկարության տարբեր կետերում,այնուհետև գտնել միջինը արժեքը:

source: Density
hy_am: Խտություն

source: Enter your filament density here. This is only for statistical information. A decent way is to weigh a known length of filament and compute the ratio of the length to volume. Better is to calculate the volume directly through displacement.
hy_am: Մուտքագրեք լցանյութի խտությունը: Սա միայն վիճակագրական տեղեկատվության համար է:Ավելի ճիշտ միջոց է չաթել լցանյութի իրական երկարությունը և հաշվարկել երկարությանու ծավալի հարաբերակցությունը: Նաև լավ տարբերակ է ծավալը հաշվարկել ուղղակի տեղաշարժելով այն:

source: Cost
hy_am: Արժեք

source: Enter your filament cost per kg here. This is only for statistical information.
hy_am: Մուտքագրել լցանյութի արժեքը 1 կգ-ի համար: Սա միայն վիճակագրական տեղեկատվության համար է:

source: money/kg
hy_am: ֏/կգ

source: Fill angle
hy_am: Լցնել անկյունը

source: Default base angle for infill orientation. Cross-hatching will be applied to this. Bridges will be infilled using the best direction Slic3r can detect, so this setting does not affect them.
hy_am: Լցոնման կողմնորոշումը կանխադրված հիմքի անկյան համար: Դրա վրա կկիրառվի խաչաձև երեսպատում:Կամուրջները կլրացվեն Slic3r-ը կողմից հայտնաբերված լավագույն ուղղությամբ, ուստիայս կարգավորումը չի ազդի կամուրջների վրա:

source: Fill density
hy_am: Լրացման խտությունը

source: Density of internal infill, expressed in the range 0% - 100%.
hy_am: Ներսի լցոնման խտությունը արտահայտված 0% - 100% միջակայքում

source: Fill gaps
hy_am: Լցնել բաց տեղերը

source: If this is enabled, gaps will be filled with single passes. Enable this for better quality, disable it for shorter printing times.
hy_am: Եթե սա միացված է, բացերը կլրացվեն մեկ փոխանցումով: Միացրեք սա ավելի լավ որակի համար։Անջատելու դեպքում կկրճատվի տպագրության ժամանակը։

source: Fill pattern
hy_am: Լրացման նախշը

source: Fill pattern for general low-density infill.
hy_am: Լրացնել նախշը սովորաական ցածր խտության լցոնում ստանալու համար:

source: First layer
hy_am: Առաջին շերտ

source: This is the acceleration your printer will use for first layer. Set zero to disable acceleration control for first layer.
hy_am: Սա այն արագացումն է, որը կօգտագործի Ձեր տպիչը առաջին շերտի համար: Սահմանեք զերո, եթեցանկանում եք անջատել արագացման կառավարումն առաջին շերտի համար

source: Heated build plate temperature for the first layer. Set this to zero to disable bed temperature control commands in the output.
hy_am: Տաքացվող հարթակի ջերմաստիճանը առաջին շերտի համար: Սահմանեք զերո, եթե ցանկանում եք անջատել հարթակի ջերմաստիճանի վերահսկման հրամաններն ելքային նիշքում:

source: Set this to a non-zero value to set a manual extrusion width for first layer. You can use this to force fatter extrudates for better adhesion. If expressed as percentage (for example 120%) it will be computed over first layer height.
hy_am: Սահմանեք ոչ զրոյական արժեք, եթե ցանկանում եք կիրառել ձեռքով արտամղման հնարավորությունը առաջին շերտի դեպքում: Սա կարող եք օգտագործել ավելի հաստ գլխիկների դեպքում, որպեսզի:կպչունությունը ավելի պինդ լինի։ Եթե այն գրվի տոկոսով (օրինակ՝ 120%), ապա այն կհաշվարկվի առաջին շերտի բարձրության վրա:

source: First layer height
hy_am: Առաջին շերտի բարձրություը

source: When printing with very low layer heights, you might still want to print a thicker bottom layer to improve adhesion and tolerance for non perfect build plates. This can be expressed as an absolute value or as a percentage (for example: 150%) over the default layer height.
hy_am: Երբ շերտը տպում եք շատ ցածր բարձրություններով, ապա իմացեք, որ ամեն դեպքում ներքևի շերտը պետք էավելի հաստ տպել կպչունությունը բարելավելու և հարմարեցնելու ոչ կատարյալ հարրթակներ համար: Սա կարող է արտահայտվել որպես բացարձակ արժեք կամ որպես տոկոս (օրինակ՝ 150%)սովորական շերտի բարձրության արժեքի նկատմամբ:

source: First layer speed
hy_am: Առաջին շերտի արագությունը

source: If expressed as absolute value in mm/s, this speed will be applied to all the print moves of the first layer, regardless of their type. If expressed as a percentage (for example: 40%) it will scale the default speeds.
hy_am: Եթե գրվում է որպես բացարձակ արժեք մմ/վրկ-ով, ապա այս արագությունը կկիրառվիառաջին շերտի բոլոր տպագրական շարժումների վրա՝ անկախ դրանց տեսակից: Եթե գրվի

source: Extruder temperature for first layer. If you want to control temperature manually during print, set this to zero to disable temperature control commands in the output file.
hy_am: Գլխիկի ջերմաստիճանը առաջին շերտի համար: Եթե ցանկանում եք ձեռքով կառավարելջերմաստիճանը տպման ժամանակ, ապա սա պետք է սահմանել զրոյի՝ ելքային նիշքումջերմաստիճանի վերահսկման հրամաններն անջատելու համար:

source: ↳ gaps
hy_am: ↳ բացեր

source: Speed for filling gaps. Since these are usually single lines you might want to use a low speed for better sticking. If expressed as percentage (for example: 80%) it will be calculated on the infill speed setting above.
hy_am: Բացերը լցնելու արագություն: Քանի որ դրանք սովորաբար միայնակ գծեր են,կարող եք օգտագործել ցածր արագություն ավելի լավ կպչելու համար: Եթե գրում եք տոկոսով (օրինակ՝ 80%), ապա այն կհաշվարկվի վերը նշված լցոնման արագության կարգավորմամբ:

source: Use native G-code arcs
hy_am: Օգտագործել G-code֊ի սեփական կամարները

source: This experimental feature tries to detect arcs from segments and generates G2/G3 arc commands instead of multiple straight G1 commands.
hy_am: Այս փորձնական հատկությունը փորձում է հատվածներից գտնել աղեղները և ստեղծում էG2/G3 աղեղային հրամաններ՝ բազմակի G1 հրամանների փոխարեն:

source: Verbose G-code
hy_am: Մեկնաբանությամբ G-code

source: Enable this to get a commented G-code file, with each line explained by a descriptive text. If you print from SD card, the additional weight of the file could make your firmware slow down.
hy_am: Միացնելու դեպքում կունենաք մեկնաբանություններով G-code֊ի նիշք, որտեղ յուրաքանչյուրտող բացատրվում է նկարագրական տեքստով: Եթե տպում եք SD քարտից, նիշքի լրացուցիչծավալը կարող է դանդաղեցնել ապարատուրային ծրագիրը:

source: G-code flavor
hy_am: G-code֊ի տարբերակ

source: Some G/M-code commands, including temperature control and others, are not universal. Set this option to your printer's firmware to get a compatible output. The "No extrusion" flavor prevents Slic3r from exporting any extrusion value at all.
hy_am: Որոշ G/M կոդի հրամաններ, ներառյալ ջերմաստիճանի վերահսկումը չեն կարող լինելհամընդհանուր բոլոր տպիչների կամ մաոդելների համար: Այս տարբերակը միացնելու դեպքումկունենաք տպիչի ապարատուրային ծրագրի համատեղելի արդյունք: "Առանց արտամղման" տարրըկանխում է Slic3r-ին արտահանել ցանկացած արտամղման արժեք:

source: This is the acceleration your printer will use for infill. Set zero to disable acceleration control for infill.
hy_am: Սա ձեր տպիչի լցոնման արագացումն է: Զրոի դեպքում այն կանջատի կառավարումըլցոնման արագացման համար։

source: Combine infill every
hy_am: Միավորել յուրաքանչյուր լցոնումը

source: This feature allows to combine infill and speed up your print by extruding thicker infill layers while preserving thin perimeters, thus accuracy.
hy_am: Այս հատկությունը թույլ է տալիս համատեղել լցոնումը և արագացնել տպագրությունը՝արտամղելով լցոնման ավելի հաստ շերտերը, միևնույն ժամանակ պահպանելով բարակ պարագծերը,հետևաբար ճշգրտությունը:

source: Infill extruder
hy_am: Լցոնել գլխիկը

source: The extruder to use when printing infill.
hy_am: Գլխիկ, որը պետք է օգտագործվի տպագրության լցոնման համար:

source: Set this to a non-zero value to set a manual extrusion width for infill. You may want to use fatter extrudates to speed up the infill and make your parts stronger. If expressed as percentage (for example 90%) it will be computed over layer height.
hy_am: Սահմանեք սա ոչ զրոյական արժեքի՝ լցոնման համար ձեռքով արտամղման լայնությունըլրացնելու համար: Կարող եք օգտագործել ավելի հաստ տրամագծով գլխիկներ՝ լցոնումըարագացնելու և դետալներն ավելի ամուր դարձնելու համար: Եթե գրվի տոկոսով, ապա(օրինակ՝ 90%), այն կհաշվարկվի շերտի բարձրության վրա:

source: Infill before perimeters
hy_am: Լցոնում պարագծերից առաջ

source: This option will switch the print order of perimeters and infill, making the latter first.
hy_am: Այս տարբերակը կփոխի շրջագծերի տպագրության և լցոնման կարգը՝ փոխելով վերջինի ուառաջինի տեղերը։

source: Only infill where needed
hy_am: Լցոնել միայն անհրաժեշտության դեպքում

source: This option will limit infill to the areas actually needed for supporting ceilings (it will act as internal support material). If enabled, slows down the G-code generation due to the multiple checks involved.
hy_am: Այս տարբերակը կսահմանափակի որոշ տարածքների լցոնումը, որոնցից է օրինակ առաստաղներիօժանդակ հատվածները (այն կգործի որպես ներքին օժանդակ նյութ): Միացնելու դեպքում այն կդանդաղեցնի G-code-ի գեներացումը բազմաթիվ ստուգումների պատճառով:

source: Infill/perimeters overlap
hy_am: Լցոնման/շրջագծերի համընկնում
